Revit 2027 API
FabricationPart.DomainType Property
 The domain type for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorDomainType DomainType { get; }
Public ReadOnly Property DomainType As ConnectorDomainType
	Get
public:
property ConnectorDomainType DomainType {
	ConnectorDomainType get ();
}
member DomainType : ConnectorDomainType with get
Property Value
ConnectorDomainType
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace